MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F303ZD/mcu.h
#define FMC_BWTRx_ACCMOD_Pos        (28U)                                      
#define FMC_BWTRx_ACCMOD_Msk        (0x3UL << FMC_BWTRx_ACCMOD_Pos)             /*!< 0x30000000 */
#define FMC_BWTRx_ACCMOD            FMC_BWTRx_ACCMOD_Msk                       /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BWTRx_ACCMOD_0          (0x1UL << FMC_BWTRx_ACCMOD_Pos)             /*!< 0x10000000 */
#define FMC_BWTRx_ACCMOD_1          (0x2UL << FMC_BWTRx_ACCMOD_Pos)             /*!< 0x20000000 */

/* Old Bit definition for FMC_BWTRx register maintained for legacy purpose */
#define  FMC_BWTRx_ADDSETx                  FMC_BWTRx_ADDSET
#define  FMC_BWTRx_ADDSETx_0                FMC_BWTRx_ADDSET_0
#define  FMC_BWTRx_ADDSETx_1                FMC_BWTRx_ADDSET_1
#define  FMC_BWTRx_ADDSETx_2                FMC_BWTRx_ADDSET_2
#define  FMC_BWTRx_ADDSETx_3                FMC_BWTRx_ADDSET_3

#define  FMC_BWTRx_ADDHLDx                  FMC_BWTRx_ADDHLD
#define  FMC_BWTRx_ADDHLDx_0                FMC_BWTRx_ADDHLD_0
#define  FMC_BWTRx_ADDHLDx_1                FMC_BWTRx_ADDHLD_1
#define  FMC_BWTRx_ADDHLDx_2                FMC_BWTRx_ADDHLD_2
#define  FMC_BWTRx_ADDHLDx_3                FMC_BWTRx_ADDHLD_3

#define  FMC_BWTRx_DATASTx                  FMC_BWTRx_DATAST
#define  FMC_BWTRx_DATASTx_0                FMC_BWTRx_DATAST_0
#define  FMC_BWTRx_DATASTx_1                FMC_BWTRx_DATAST_1
#define  FMC_BWTRx_DATASTx_2                FMC_BWTRx_DATAST_2
#define  FMC_BWTRx_DATASTx_3                FMC_BWTRx_DATAST_3
#define  FMC_BWTRx_DATASTx_4                FMC_BWTRx_DATAST_4
#define  FMC_BWTRx_DATASTx_5                FMC_BWTRx_DATAST_5
#define  FMC_BWTRx_DATASTx_6                FMC_BWTRx_DATAST_6
#define  FMC_BWTRx_DATASTx_7                FMC_BWTRx_DATAST_7

#define  FMC_BWTRx_ACCMODx                  FMC_BWTRx_ACCMOD
#define  FMC_BWTRx_ACCMODx_0                FMC_BWTRx_ACCMOD_0
#define  FMC_BWTRx_ACCMODx_1                FMC_BWTRx_ACCMOD_1

/******************  Bit definition for FMC_BWTR1 register  ******************/
#define FMC_BWTR1_ADDSET_Pos        (0U)                                       
#define FMC_BWTR1_ADDSET_Msk        (0xFUL << FMC_BWTR1_ADDSET_Pos)             /*!< 0x0000000F */
#define FMC_BWTR1_ADDSET            FMC_BWTR1_ADDSET_Msk                       /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define FMC_BWTR1_ADDSET_0          (0x1UL << FMC_BWTR1_ADDSET_Pos)             /*!< 0x00000001 */
#define FMC_BWTR1_ADDSET_1          (0x2UL << FMC_BWTR1_ADDSET_Pos)             /*!< 0x00000002 */
#define FMC_BWTR1_ADDSET_2          (0x4UL << FMC_BWTR1_ADDSET_Pos)             /*!< 0x00000004 */
#define FMC_BWTR1_ADDSET_3          (0x8UL << FMC_BWTR1_ADDSET_Pos)             /*!< 0x00000008 */

#define FMC_BWTR1_ADDHLD_Pos        (4U)                                       
#define FMC_BWTR1_ADDHLD_Msk        (0xFUL << FMC_BWTR1_ADDHLD_Pos)             /*!< 0x000000F0 */
#define FMC_BWTR1_ADDHLD            FMC_BWTR1_ADDHLD_Msk                       /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define FMC_BWTR1_ADDHLD_0          (0x1UL << FMC_BWTR1_ADDHLD_Pos)             /*!< 0x00000010 */
#define FMC_BWTR1_ADDHLD_1          (0x2UL << FMC_BWTR1_ADDHLD_Pos)             /*!< 0x00000020 */
#define FMC_BWTR1_ADDHLD_2          (0x4UL << FMC_BWTR1_ADDHLD_Pos)             /*!< 0x00000040 */
#define FMC_BWTR1_ADDHLD_3          (0x8UL << FMC_BWTR1_ADDHLD_Pos)             /*!< 0x00000080 */

#define FMC_BWTR1_DATAST_Pos        (8U)                                       
#define FMC_BWTR1_DATAST_Msk        (0xFFUL << FMC_BWTR1_DATAST_Pos)            /*!< 0x0000FF00 */
#define FMC_BWTR1_DATAST            FMC_BWTR1_DATAST_Msk                       /*!<DATAST [3:0] bits (Data-phase duration) */
#define FMC_BWTR1_DATAST_0          (0x01UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00000100 */
#define FMC_BWTR1_DATAST_1          (0x02UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00000200 */
#define FMC_BWTR1_DATAST_2          (0x04UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00000400 */
#define FMC_BWTR1_DATAST_3          (0x08UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00000800 */
#define FMC_BWTR1_DATAST_4          (0x10UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00001000 */
#define FMC_BWTR1_DATAST_5          (0x20UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00002000 */
#define FMC_BWTR1_DATAST_6          (0x40UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00004000 */
#define FMC_BWTR1_DATAST_7          (0x80UL << FMC_BWTR1_DATAST_Pos)            /*!< 0x00008000 */

#define FMC_BWTR1_CLKDIV_Pos        (20U)                                      
#define FMC_BWTR1_CLKDIV_Msk        (0xFUL << FMC_BWTR1_CLKDIV_Pos)             /*!< 0x00F00000 */
#define FMC_BWTR1_CLKDIV            FMC_BWTR1_CLKDIV_Msk                       /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define FMC_BWTR1_CLKDIV_0          (0x1UL << FMC_BWTR1_CLKDIV_Pos)             /*!< 0x00100000 */
#define FMC_BWTR1_CLKDIV_1          (0x2UL << FMC_BWTR1_CLKDIV_Pos)             /*!< 0x00200000 */
#define FMC_BWTR1_CLKDIV_2          (0x4UL << FMC_BWTR1_CLKDIV_Pos)             /*!< 0x00400000 */
#define FMC_BWTR1_CLKDIV_3          (0x8UL << FMC_BWTR1_CLKDIV_Pos)             /*!< 0x00800000 */

#define FMC_BWTR1_DATLAT_Pos        (24U)                                      
#define FMC_BWTR1_DATLAT_Msk        (0xFUL << FMC_BWTR1_DATLAT_Pos)             /*!< 0x0F000000 */
#define FMC_BWTR1_DATLAT            FMC_BWTR1_DATLAT_Msk                       /*!<DATLA[3:0] bits (Data latency) */
#define FMC_BWTR1_DATLAT_0          (0x1UL << FMC_BWTR1_DATLAT_Pos)             /*!< 0x01000000 */
#define FMC_BWTR1_DATLAT_1          (0x2UL << FMC_BWTR1_DATLAT_Pos)             /*!< 0x02000000 */
#define FMC_BWTR1_DATLAT_2          (0x4UL << FMC_BWTR1_DATLAT_Pos)             /*!< 0x04000000 */
#define FMC_BWTR1_DATLAT_3          (0x8UL << FMC_BWTR1_DATLAT_Pos)             /*!< 0x08000000 */

#define FMC_BWTR1_ACCMOD_Pos        (28U)                                      
#define FMC_BWTR1_ACCMOD_Msk        (0x3UL << FMC_BWTR1_ACCMOD_Pos)             /*!< 0x30000000 */
#define FMC_BWTR1_ACCMOD            FMC_BWTR1_ACCMOD_Msk                       /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BWTR1_ACCMOD_0          (0x1UL << FMC_BWTR1_ACCMOD_Pos)             /*!< 0x10000000 */
#define FMC_BWTR1_ACCMOD_1          (0x2UL << FMC_BWTR1_ACCMOD_Pos)             /*!< 0x20000000 */

/******************  Bit definition for FMC_BWTR2 register  ******************/
#define FMC_BWTR2_ADDSET_Pos        (0U)                                       
#define FMC_BWTR2_ADDSET_Msk        (0xFUL << FMC_BWTR2_ADDSET_Pos)             /*!< 0x0000000F */
#define FMC_BWTR2_ADDSET            FMC_BWTR2_ADDSET_Msk                       /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define FMC_BWTR2_ADDSET_0          (0x1UL << FMC_BWTR2_ADDSET_Pos)             /*!< 0x00000001 */
#define FMC_BWTR2_ADDSET_1          (0x2UL << FMC_BWTR2_ADDSET_Pos)             /*!< 0x00000002 */
#define FMC_BWTR2_ADDSET_2          (0x4UL << FMC_BWTR2_ADDSET_Pos)             /*!< 0x00000004 */
#define FMC_BWTR2_ADDSET_3          (0x8UL << FMC_BWTR2_ADDSET_Pos)             /*!< 0x00000008 */

#define FMC_BWTR2_ADDHLD_Pos        (4U)                                       
#define FMC_BWTR2_ADDHLD_Msk        (0xFUL << FMC_BWTR2_ADDHLD_Pos)             /*!< 0x000000F0 */
#define FMC_BWTR2_ADDHLD            FMC_BWTR2_ADDHLD_Msk                       /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define FMC_BWTR2_ADDHLD_0          (0x1UL << FMC_BWTR2_ADDHLD_Pos)             /*!< 0x00000010 */
#define FMC_BWTR2_ADDHLD_1          (0x2UL << FMC_BWTR2_ADDHLD_Pos)             /*!< 0x00000020 */
#define FMC_BWTR2_ADDHLD_2          (0x4UL << FMC_BWTR2_ADDHLD_Pos)             /*!< 0x00000040 */
#define FMC_BWTR2_ADDHLD_3          (0x8UL << FMC_BWTR2_ADDHLD_Pos)             /*!< 0x00000080 */

#define FMC_BWTR2_DATAST_Pos        (8U)                                       
#define FMC_BWTR2_DATAST_Msk        (0xFFUL << FMC_BWTR2_DATAST_Pos)            /*!< 0x0000FF00 */
#define FMC_BWTR2_DATAST            FMC_BWTR2_DATAST_Msk                       /*!<DATAST [3:0] bits (Data-phase duration) */
#define FMC_BWTR2_DATAST_0          (0x01UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00000100 */
#define FMC_BWTR2_DATAST_1          (0x02UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00000200 */
#define FMC_BWTR2_DATAST_2          (0x04UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00000400 */
#define FMC_BWTR2_DATAST_3          (0x08UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00000800 */
#define FMC_BWTR2_DATAST_4          (0x10UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00001000 */
#define FMC_BWTR2_DATAST_5          (0x20UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00002000 */
#define FMC_BWTR2_DATAST_6          (0x40UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00004000 */
#define FMC_BWTR2_DATAST_7          (0x80UL << FMC_BWTR2_DATAST_Pos)            /*!< 0x00008000 */

